{"codeList":["pip install --upgrade pymilvus\npip install \"pymilvus[model]\"\n","from pymilvus.model.reranker import CrossEncoderRerankFunction\n\n# Define the rerank function\nce_rf = CrossEncoderRerankFunction(\n    model_name=\"cross-encoder/ms-marco-MiniLM-L-6-v2\",  # Specify the model name.\n    device=\"cpu\" # Specify the device to use, e.g., 'cpu' or 'cuda:0'\n)\n","query = \"What event in 1956 marked the official birth of artificial intelligence as a discipline?\"\n\ndocuments = [\n    \"In 1950, Alan Turing published his seminal paper, 'Computing Machinery and Intelligence,' proposing the Turing Test as a criterion of intelligence, a foundational concept in the philosophy and development of artificial intelligence.\",\n    \"The Dartmouth Conference in 1956 is considered the birthplace of artificial intelligence as a field; here, John McCarthy and others coined the term 'artificial intelligence' and laid out its basic goals.\",\n    \"In 1951, British mathematician and computer scientist Alan Turing also developed the first program designed to play chess, demonstrating an early example of AI in game strategy.\",\n    \"The invention of the Logic Theorist by Allen Newell, Herbert A. Simon, and Cliff Shaw in 1955 marked the creation of the first true AI program, which was capable of solving logic problems, akin to proving mathematical theorems.\"\n]\n\nresults = ce_rf(\n    query=query,\n    documents=documents,\n    top_k=3,\n)\n\nfor result in results:\n    print(f\"Index: {result.index}\")\n    print(f\"Score: {result.score:.6f}\")\n    print(f\"Text: {result.text}\\n\")\n","Index: 1\nScore: 6.250533\nText: The Dartmouth Conference in 1956 is considered the birthplace of artificial intelligence as a field; here, John McCarthy and others coined the term 'artificial intelligence' and laid out its basic goals.\n\nIndex: 0\nScore: -2.954602\nText: In 1950, Alan Turing published his seminal paper, 'Computing Machinery and Intelligence,' proposing the Turing Test as a criterion of intelligence, a foundational concept in the philosophy and development of artificial intelligence.\n\nIndex: 3\nScore: -4.771512\nText: The invention of the Logic Theorist by Allen Newell, Herbert A. Simon, and Cliff Shaw in 1955 marked the creation of the first true AI program, which was capable of solving logic problems, akin to proving mathematical theorems.\n"],"headingContent":"Cross Encoder","anchorList":[{"label":"Cross Encoder","href":"Cross-Encoder","type":1,"isActive":false}]}